# Pandas Assignment 1

In [1]:
import pandas as pd

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

In [16]:
users = pd.read_csv(url,sep = "|")

In [18]:
users = users.set_index(['user_id'])

# First 10 entries

In [20]:
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

# Last 10 entries

In [21]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# What is the number of observations in the dataset?

In [41]:
cnt = users.count()

In [44]:
print(f"the no of observations are {cnt['age']}")

the no of observations are 943

# What is the number of columns in the dataset?

In [47]:
clm = users.shape

In [48]:
print(f"the no of columns are {clm[1]}")

the no of columns are 4

# Print the name of all the columns.

In [52]:
nme = users.columns

In [54]:
print(f"the column names are:\n {nme}")

the column names are:
 Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

# How is the dataset indexed?

In [59]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

# What is the data type of each column?

In [63]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# Print only the occupation column

In [64]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# How many different occupations are in this dataset?

In [81]:
df = users['occupation'].describe()

In [82]:
print(f"the different occupations are {df['unique']}")

the different occupations are 21

# What is the most frequent occupation?

In [89]:
 users['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [90]:
print("the most frequent occupation is 'student'")

the most frequent occupation is 'student'

# DataFrame Info.

In [91]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

# Summarize only the occupation column

In [94]:
users['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

# Describe all the columns

In [95]:
users.value_counts()

age  gender  occupation  zip_code
28   M       student     55414       2
44   F       other       60630       2
17   M       student     60402       2
51   M       educator    20003       2
21   F       student     55414       2
                                    ..
27   M       lawyer      47130       1
             marketing   11217       1
                         19382       1
             other       30350       1
73   M       retired     37771       1
Length: 936, dtype: int64

# What is the mean age of users?

In [98]:
age = users['age'].describe()

In [99]:
print(f"the mean age of users are {age['mean']}")

the mean age of users are 34.05196182396607

# What is the age with least occurrence?

In [103]:
lst = users['age'].min()

In [104]:
print(f"the age with least occurrence is {lst}")

the age with least occurrence is 7